app/controllers/api/V1/routes_controller.rb

SELECT "routes".* FROM "routes" WHERE "routes"."trip_id" = ?  [["trip_id", 1]]
---
  def index
    if @trip
      @routes = @trip.routes
    else
      @routes = Route.all

SELECT "routes".* FROM "routes" WHERE "routes"."trip_id" = ? AND "routes"."route_id" = ? LIMIT ?  [["trip_id", 1], ["route_id", 7000266], ["LIMIT", 1]]
INSERT INTO "routes" ("trip_id", "route_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["trip_id", 1], ["route_id", 7000538], ["created_at", "2020-06-15 19:54:50.138632"], ["updated_at", "2020-06-15 19:54:50.138632"]]
---
  def create
    if @trip.routes.find_by(route_id: params[:route_id])
      render json: {error: "Route already added to trip"}
    else
      @route = @trip.routes.build(route_params)
      if @route.save

SELECT "routes".* FROM "routes" WHERE "routes"."trip_id" = ?  [["trip_id", 1]]
---
  def show
    @route = @trip.routes.find_by(id: params[:id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_trip
    @trip = Trip.find(params[:trip_id])