app/controllers/api/V1/trips_controller.rb

INSERT INTO "trips" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Breakfast"], ["description", "This is an awesome trip!"], ["created_at", "2020-07-13 19:20:49.529601"], ["updated_at", "2020-07-13 19:20:49.529601"]]
---
  def create
    @trip = Trip.new(trip_params)
    if @trip.save